# FabricParamCoverOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamCoverOffset Property
ParameterTypeId Class See Also
---
"Additional Cover Offset": Additional cover offset of the fabric distribution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamCoverOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamCoverOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamCoverOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace